#+title: Laws of Form Reference
#+date: <2025-12-15 Sun>
#+author: Valerie Kim
#+property: header-args:python :session lof-ref :results output :python "../.venv/bin/python"

** S-Expression Rendering

#+begin_src python
from lofbench.renderers import get_renderer, SEXPR_PRESETS

expressions = [
    "()",
    "(())",
    "()()",
    "((())())",
]

# Default preset (x)
print("\n=== S-Expression Rendering ===")
print("\nDefault preset (symbol='x'):")
sexpr = get_renderer("sexpr")
for expr in expressions:
    result = sexpr.render(expr)
    print(f"  {expr:15} → {result.rendered}")

# Lisp preset
print("\nLisp preset (symbol='quote'):")
sexpr_lisp = get_renderer("sexpr", preset="lisp")
for expr in expressions:
    result = sexpr_lisp.render(expr)
    print(f"  {expr:15} → {result.rendered}")

# Rust preset
print("\nRust preset (symbol='Box::new'):")
sexpr_rust = get_renderer("sexpr", preset="rust")
for expr in expressions:
    result = sexpr_rust.render(expr)
    print(f"  {expr:15} → {result.rendered}")

# Custom symbol
print("\nCustom symbol ('mark'):")
sexpr_mark = get_renderer("sexpr", symbol="mark")
for expr in expressions:
    result = sexpr_mark.render(expr)
    print(f"  {expr:15} → {result.rendered}")
#+end_src

#+RESULTS:
#+begin_example

=== S-Expression Rendering ===

Default preset (symbol='x'):
  ()              → (x)
  (())            → (x (x))
  ()()            → (x) (x)
  ((())())        → (x (x (x)) (x))

Lisp preset (symbol='quote'):
  ()              → (quote)
  (())            → (quote (quote))
  ()()            → (quote) (quote)
  ((())())        → (quote (quote (quote)) (quote))

Rust preset (symbol='Box::new'):
  ()              → (Box::new)
  (())            → (Box::new (Box::new))
  ()()            → (Box::new), (Box::new)
  ((())())        → (Box::new (Box::new (Box::new)), (Box::new))

Custom symbol ('mark'):
  ()              → (mark)
  (())            → (mark (mark))
  ()()            → (mark) (mark)
  ((())())        → (mark (mark (mark)) (mark))
#+end_example

*** Available S-Expression Presets

#+begin_src python
from lofbench.renderers import SEXPR_PRESETS

print("=== Available S-Expression Presets ===\n")
for name, config in SEXPR_PRESETS.items():
    print(f"{name:10}: symbol='{config['symbol']}', delims='{config['open']}...{config['close']}', sep='{config['separator']}'")
#+end_src

#+RESULTS:
: === Available S-Expression Presets ===
: 
: default   : symbol='x', delims='(...)', sep=' '
: lisp      : symbol='quote', delims='(...)', sep=' '
: scheme    : symbol='cons', delims='(...)', sep=' '
: python    : symbol='fn', delims='(...)', sep=', '
: rust      : symbol='Box::new', delims='(...)', sep=', '
: java      : symbol='new Node', delims='(...)', sep=', '
: haskell   : symbol='Node', delims=' ...', sep=' '

** Visual Circle Rendering

#+begin_src python
from lofbench.renderers import SVGCircleRenderer, SVGCircleConfig
import urllib.parse
from pathlib import Path

# Create output directory
output_dir = Path("feedback")
output_dir.mkdir(exist_ok=True)

# Simple examples to demonstrate
simple_expressions = [
    "()",
    "(())",
    "()()",
    "((())())",
]

# Outline renderer
outline_renderer = SVGCircleRenderer(config=SVGCircleConfig(fill_style="none"))

# Filled renderer
filled_renderer = SVGCircleRenderer(config=SVGCircleConfig(fill_style="alternating"))

print("=== SVG Circle Rendering ===\n")
print("Generating sample SVGs...\n")

for i, expr in enumerate(simple_expressions, 1):
    outline_result = outline_renderer.render(expr)
    filled_result = filled_renderer.render(expr)

    # Decode and save
    outline_svg = urllib.parse.unquote(
        outline_result.rendered.replace("data:image/svg+xml;charset=utf-8,", "")
    )
    filled_svg = urllib.parse.unquote(
        filled_result.rendered.replace("data:image/svg+xml;charset=utf-8,", "")
    )

    outline_path = output_dir / f"simple_{i}_outline.svg"
    filled_path = output_dir / f"simple_{i}_filled.svg"

    outline_path.write_text(outline_svg)
    filled_path.write_text(filled_svg)

    print(f"{expr:15} → {outline_path.name} / {filled_path.name}")

print(f"\nSaved SVGs to: {output_dir}/")
#+end_src

#+RESULTS:
#+begin_example
=== SVG Circle Rendering ===

Generating sample SVGs...

()              → simple_1_outline.svg / simple_1_filled.svg
(())            → simple_2_outline.svg / simple_2_filled.svg
()()            → simple_3_outline.svg / simple_3_filled.svg
((())())        → simple_4_outline.svg / simple_4_filled.svg

Saved SVGs to: feedback/
#+end_example

